Tekla.Structures.Drawing.ArrowheadAttributes
The ArrowheadAttributes class handles attributes related to arrowheads of different objects.

Tekla.Structures.Drawing.ArrowheadAttributes.ArrowPosition
The position of the arrowhead. The position is always ArrowheadPositions.Both for dimensions.

Tekla.Structures.Drawing.ArrowheadAttributes.Head
The type of the arrowhead.

Tekla.Structures.Drawing.ArrowheadAttributes.Height
The height of the arrowhead.

Tekla.Structures.Drawing.ArrowheadAttributes.Width
The width of the arrowhead.

Tekla.Structures.Drawing.ArrowheadAttributes.#ctor
Creates a new default arrowhead attributes instance. The default values are ArrowheadPositions.None, ArrowheadTypes.FilledArrow, height 2.0 and width 1.0.

Tekla.Structures.Drawing.ArrowheadAttributes.#ctor(Tekla.Structures.Drawing.ArrowheadPositions,Tekla.Structures.Drawing.ArrowheadTypes,System.Double,System.Double)
Creates a new arrowhead attributes instance with the given parameters.
arrowPosition: The arrowhead position.
head: The arrowhead type.
height: The arrowhead height.
width: The arrowhead width.

Tekla.Structures.Drawing.ArrowheadAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.